import java.util.Scanner;

// 6 задание на 22 странице.
public class Task1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Write your x: ");
        double x = scanner.nextDouble();
        System.out.print("Write your y: ");
        double y = scanner.nextDouble();
        boolean toBig = Math.pow((x - 0), 2) + Math.pow((y - 0), 2) <= Math.pow(2, 2);
        boolean toSmall = Math.pow((x + 1), 2) + Math.pow((y - 0), 2) <= Math.pow(1, 2);
        if (toBig&&!toSmall) System.out.printf("Точка с координатами x = %d, y = %d принадлежит указанной плоскости.", x, y);
        else System.out.printf("Точка с координатами [%d, %d] не принадлежит указанной плоскости.", x, y);
    }
}

/*
    Д/З -  страница 22, 6 задача; страница 29, номер 7
    Операции отношений. Операторы >, >=,  ==, <=, <, !=
    Вывод: True & False

    Логические операции
        Логическое умножение - && равносильно "И" (если оба операнда истинны)
        Логическое сложение  - || равносильно "ИЛИ" (если один из операндов истинный)
        Исключающее "ИЛИ"    - ^ (если только один из операндов истинный)
        Логическое отрицание - !  равносильно "НЕ"(принимает значение, противоположное значению операнда)
         _____ _____ _________ _________ _______ _____ _____
        |     |     |         |         |       |     |     |
        |  a  |  b  | a & & b | a | | b | a ^ b | ! a | ! b |
        |_____|_____|_________|_________|_______|_____|_____|
        |     |     |         |         |       |     |     |
        |  1  |  1  |    1    |    1    |   0   |  0  |  0  |
        |_____|_____|_________|_________|_______|_____|_____|
        |     |     |         |         |       |     |     |
        |  1  |  0  |    0    |    1    |   1   |  0  |  1  |
        |_____|_____|_________|_________|_______|_____|_____|
        |     |     |         |         |       |     |     |
        |  0  |  1  |    0    |    1    |   1   |  1  |  0  |
        |_____|_____|_________|_________|_______|_____|_____|
        |     |     |         |         |       |     |     |
        |  0  |  0  |    0    |    0    |   0   |  1  |  1  |
        |_____|_____|_________|_________|_______|_____|_____|

        Приоритетные операции
            Самый высокий приоритет - операция НЕ


    (x * y != 4) && (y > x) x = 1, y = 2
    (y>=1)||((y<=-3)&&(y>=-4))

*/